Autodesk.Revit.DB.View.SetLinkOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.RevitLinkGraphicsSettings)
Sets the graphic overrides of a Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance in the view.
linkId:
The id of the Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance.
linkDisplaySettings:
Settings representing all link graphic overrides in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not a valid RevitLinkInstance or RevitLinkType id.
-or-
The LinkedViewId of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The ViewFilterType of linkDisplaySettings has incorrect value.
-or-
The ViewRange of linkDisplaySettings has unsupported value.
-or-
The phase or pahse type of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The phase filter or phase filter type of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The view detail level or the type of view detail level of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The discipline or the discipline type of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The ColorFill of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The ObjectStyles of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
-or-
The NestedLinks of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
-or-
The view does not support link graphical overrides.
Since:
2024

Autodesk.Revit.DB.View.GetLinkOverrides(Autodesk.Revit.DB.ElementId)
Gets the graphic overrides of a Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance in view.
linkId:
The id of the Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance.
Returns:
Settings representing graphic overrides for the input element id in the view, or null if the input id references Autodesk.Revit.DB.RevitLinkInstance and it doesn't have overrides in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not a valid RevitLinkInstance or RevitLinkType id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024